#ifndef INCLUDED_DEBUG
#define INCLUDED_DEBUG
//******************************************************************************
//
//
//      Debug
//
//
//******************************************************************************

//------< インクルード >---------------------------------------------------------
#include <queue>
#include "sprite.h"

namespace GameLib
{

    //==========================================================================
    //
    //      Debugクラス
    //
    //==========================================================================
    class Debug : public SpriteBatch
    {
    private:

        std::queue<std::string> debugQueue;
        float yPos;
        int screenHeight;

    public:

        //------------------------------------------------------
        //  コンストラクタ
        //------------------------------------------------------
        //  ID3D11Device* device        デバイス
        //  const wchar_t* fileName     画像ファイルのパス
        //  size_t maxInstance          同時に表示する最大文字数
        //  int scr_h                   スクリーンの高さ
        //------------------------------------------------------
        Debug(ID3D11Device*, const wchar_t*, size_t maxInstance = ( 8192 ), int scr_h = ( 480 ));

        //------------------------------------------------------
        //  デストラクタ
        //------------------------------------------------------
        ~Debug();

        //------------------------------------------------------
        //  デバッグ文字列の設定
        //------------------------------------------------------
        //  const char* str             表示する文字列
        //------------------------------------------------------
        void setString(const char*);

        //------------------------------------------------------
        //  デバッグ文字列の表示
        //------------------------------------------------------
        //  ID3D11DeviceContext* context    デバイスコンテキスト
        //  float r     // 色 r
        //  float g     // 色 g
        //  float b     // 色 b
        //  float sx    // スケール x
        //  float sy    // スケール y
        //------------------------------------------------------
        void display(ID3D11DeviceContext*, float r = ( 1 ), float g = ( 1 ), float b = ( 1 ), float sx = ( 1 ), float sy = ( 1 ));
    };
}

//******************************************************************************

#endif // !INCLUDED_DEBUG
